
# 项目描述
标书大模型（通过
               1、在excel表格中填写固定字段，替换模版文件中的特定字段，快速填写文件
               2、在excel中的生成指令表中，填写一些特殊位置的prompt指令，调用大模型快速生成合同文件文本）
【我调用了百度的免费模型`ERNIE-Speed-8K`】）

# 后期迭代：保持文件的文本样式
然后你可以在标书内容.doc文件中设置好各种样式（页眉、文件封面、固定内容等等），最后的生成内容都存在这里。


## 使用说明

1. 安装 `python` 环境，安装相关包：`pip install -r requirements.txt`
2. 申请ChatGPT或者 百度千帆大模型（我使用的是 `ERNIE-Speed-8K`，免费模型），申请后把Token记录下来，填写到代码当中相应key的位置
3.在`Template.docx`中设置好各类文件的模版（固定部分不变，在需要修改的位置设置标记，如“[标记位置]”）
4.excel中的sheet名与每章节名称一致，每一章的替换字段在相应的sheet中填写
5.excel中的“生成指令表”sheet用于批量在标记过的位置（“gen-xxx”）输入调用大模型的prompt
6.在运行my_main.py前，务必创建好`Template.docx`，`需求对应表v3.xlsx`
